 {"intents": [
    {"tag": "greetings", 
    "patterns": ["hello", "hey", "hi", "good day", "greetings", "what's up", "hey there", "hi there", "good morning", "good afternoon", "good evening"],
    "responses": ["Hello! What can I do for you?", "Hey! What can I do for you?"]}, 
    {"tag": "farewell", 
    "patterns": ["Goodbye", "Bye", "See you later", "ciao", "See ya", "See you", "cya", "I'm going to go now", "Talk to you later", "farewell", "catch you later"],
    "responses": ["Goodbye! Have a nice day!", "Bye! Have a great day"]},
    {"tag": "hours",
    "patterns": ["when can I call you", "how long do you operate", "how long do you work", "what are your working hours", "when are you available", "when are you unavailable"],
    "responses": ["I'm online all day. Feel free to ask me anything at anytime!", "You can ask me anything at anytime because im avaible all day, everyday."]},
    {"tag": "how_are_you",
    "patterns": ["how are you", "hello how are you", "how do you do", "hey how are you", "how's it going"],
    "responses": ["I'm doing fine! Thanks for asking! How are you?", "I'm doing great! Thank you for asking! How are you?", "I'm doing good! Thanks for asking! How are you?", "I'm doing good! How are you?"]},
    {"tag": "reply_how_are_you",
    "patterns": ["i am doing good", "im doing fine", "im doing great", "not too bad", "pretty good", "doing well"],
    "responses": ["That is good to hear! How can I assist you today?"]},
    {"tag": "name",
    "patterns": ["What is your name", "What should i call you", "whats your name", "who are you", "who am i speaking to", "can you tell me your name", "are you a bot", "are you human or a bot", "bot or human"],
    "responses":["I'm Cloudy, the voice assistant of InSync!", "My name is Cloudy, the voice assistant of InSync!", "I'm Cloudy, I am the voice assitant of InSync!"] },
    {"tag": "thanks",
    "patterns": ["thank you", "thanks", "thank you for helping me", "thanks for helping me", "thank you for your assistance", "much appreciated", "thanks a lot"],
    "responses":["You're welcome! Feel free to ask me anything!", "Anytime! Feel free to ask me anything!"] },
    {"tag": "problem",
    "patterns": ["I have a small problem", "I have a small issue", "I am facing trouble", "I am facing a problem", "I have a problem", "I have an issue"],
    "responses":["What seems to be the problem?", "What seems to be the issue?", "What troubles are you facing?", "What is it?"] },
    {"tag": "help",
    "patterns": ["can you please help me", "I am in need of assistance", "can you help me", "can you assist me please", "can you give me a hand", "i am in need of help", "need support", "urgent help needed"],
    "responses":["I am here to help!", "I can help you with some bank related issues.", "I can assist you."] },
    {"tag": "check_balance",
    "patterns": ["can you check my bank account balance", "can you check my account balance", "can you check my balance", "is it possible for you to check my bank account balance", "what's my account balance", "my account balance", "how much money do I have", "balance inquiry", "check account balance", "current balance"],
    "responses":["Yes! I can check your bank account balance. Give me a moment.", "Sure, I will check your bank account balance now. Please, give me a minute.", "Of course, I will check your bank account balance now. Please give me a moment."] },
    {"tag": "how_to_open_account",
    "patterns": ["how can I open a new account", "how am i able to open a new account", "how can i open a new bank account", "is it possible to open a new bank account", "am i able to open a bank account", "account opening process", "open new account", "start account"],
    "responses":["To open a new account, you can visit our branch and our staff will assist you with the required documentation and procedures.","You can open a new account by visiting our branch with the necessary identification documents."] },
    {"tag": "calculate_loan",
    "patterns": ["is it possible for you to calculate my loan", "can you calculate my loan", "are you able to calculate loans", "can you help me calculate my loan", "are you able to calculate loans", "how much will my loan payments be", "loan calculator", "calculate interest rate", "loan repayment calculation", "monthly loan payment"],
    "responses":["Yes! I can calculate your loans.", "Yes! I am able to calculate loans"] },
    {"tag": "account_types",
    "patterns": ["what type of accounts do you offer", "can you tell me the different type of accounts you offer", "can you tell me the different account types you offer", "what are the account types available", "What are the various account options provided", "I'm interested in opening an account. What types do you offer", "types of accounts", "account options", "account varieties"],
    "responses":["we offer various types of accounts such as savings accounts, checking accounts, money market accounts, certificates of deposit, and retirement accounts.", "types of accounts offered by us include savings accounts, checking accounts, CDs, and money market accounts. Each type serves different purposes and may have different features and benefits.", "The types of accounts offered by us generally include savings accounts, checking accounts, certificates of deposit, money market accounts, and retirement accounts. Each type has its own features and benefits."] },
    {"tag": "automatic_payments_transfers",
    "patterns": ["How can I set up automatic bill payments or transfers", "Can you guide me through the process of setting up automatic payments", "What steps do I need to take to schedule automatic transfers", "How can I set up automatic payments", "How do I set up automatic transfers"],
    "responses": ["You can set up automatic bill payments or transfers through our online banking platform or by contacting customer service. Simply provide the necessary information for the payments or transfers, including the payee details and scheduling preferences."]},
    {"tag": "report_lost_card",
    "patterns": ["How do I report a lost or stolen debit or credit card","What should I do if my debit or credit card is lost or stolen","Can you guide me through the process of reporting a lost card"],
    "responses": ["If your debit or credit card is lost or stolen, please contact our customer service immediately to report it. We will assist you with blocking the card and issuing a replacement."]},
    { "tag": "transfer_funds",
    "patterns": ["Can you explain the process for transferring funds between accounts or to another bank","How can I transfer money between my accounts","What steps do I need to take to send money to another bank","How can I send money to another account"],
    "responses": ["You can transfer funds between your accounts or to another bank through our online banking platform or mobile app. Simply initiate a transfer and provide the recipient's account details. You may also transfer funds by visiting a branch and speaking with a representative."]},
    {"tag": "order_checks_debit_card",
    "patterns": ["How can I order checks or request a new debit card","Can I order checks online","What is the process for requesting a new debit card","Can i order a new debit card", "Can i order a new credit card", "How can i get a new credit card", "How can i get a new debit card", "How can I order a check"],
    "responses": ["You can order checks or request a new debit or credit card through our online banking platform, by visiting a branch, or by contacting our customer service. Please provide the necessary information and we will assist you with your request."]},
    {"tag": "connect",
    "patterns": ["can you let me talk to the staff", "can you let me speak to a human", "can you connect a staff member", "can i speak to a person", "can you allow me to speak to an actual person", "am i allowed to speak to a person", "speak to customer service", "customer support", "talk to representative", "connect me to an agent"],
    "responses":["Yes. Give me a moment and I will connect you to customer service.", "Sure, I will connect you to our customer service sector.", "Sure. Give me a second while I connect you to our staff."]},
    {"tag": "close_account",
    "patterns": ["How do I close an account","Can you guide me through the process of closing my account","What steps do I need to take to close my account", "How can I close an account","Can you explain how I can close my account", "Can you tell me how I can close my account"],
    "responses": ["To close your account, you can visit our branch and speak with one of our representatives. Please ensure that all outstanding transactions are cleared and any associated fees are settled before closing the account."]},
    {"tag": "documents",
    "patterns": ["What are the necessary identification documents I should bring","What are the documents I should take","Can you tell me what are the identification documents i should bring", "Which documents are you talking about","which documents are you referring to", "what documents", "which documents"],
    "responses": ["The required documents are either your National Identity Card, Valid Driving License, Valid Passport that carries the NIC number and Address verification documents. Address verification documents should be given if the address given to the bank is different from the National Identity Card or Driving License."]},
    {"tag": "loan_credit_eligibility",
    "patterns": ["What are the eligibility requirements for a loan or credit card","Can you tell me about the criteria for loan or credit card approval","What factors determine eligibility for loans or credit cards","What are the requirements for a loan", "what are the requirements for a credit card"],
    "responses": ["Eligibility for loans or credit cards depends on various factors such as credit history, income, employment status, and debt-to-income ratio. Specific requirements may vary depending on the type of loan or credit card you're applying for."]},
    {"tag": "increase_withdrawal_limit",
    "patterns":["How can I increase my daily withdrawal or transaction limit","Is it possible to raise my withdrawal limit","Can you help me increase my transaction limit","How can I increase my withdrawal amount", "Is it possible to increase my transaction amount","How can i increase my transaction amount", "How can I trasnfer money that exceeds my transaction limit", "How can I withdraw money that exceeds my withdrawal limit"],
    "responses": ["To increase your daily withdrawal or transaction limit, please contact our customer service and provide details about your request. We will review your account and discuss the available options with you."]},
    {"tag": "interest_rates",
    "patterns": ["What are the interest rates on savings accounts or fixed deposits?","Can you tell me about the current interest rates on savings accounts?","What are the interest rates for fixed deposits?"],
    "responses": ["Our current interest rates for savings accounts vary depending on the account type and balance. Please visit our website or contact a representative for the most up-to-date information."]},
    {"tag": "shut_up",
    "patterns": ["Please shut up","Why can you shut up","Shut up dude","Shut up bro","dude shut up","Why won't you shut up"],
    "responses": ["There is no need to be rude. You are free to stop talking to me anytime!","You don't have to be rude. You can stop talking to me when you want to!"]}
]}